In [168]:
yol = "/workspace/DVAPYTHON11_14_082025/Egzersizler/datasets/titanic/train.csv"

Kütüphanelerin İçe Aktarılması

In [169]:
import pandas as pd
import numpy as np
pd.__version__

'2.3.1'

yukarıda yer alan yol değişkenini kullanarak seçtiğiniz veri setinin pd ile okunması

In [170]:
df = pd.read_csv(yol)

In [171]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [172]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [173]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [174]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [175]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [176]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [177]:
## Boş verilerin temizlenmesi
medyanage = df["Age"].median()
df["Age"] = df["Age"].fillna(medyanage)
df.drop(["Cabin"],axis=1,inplace=True)
modeEmbarked = df["Embarked"].mode()[0]
df["Embarked"] = df["Embarked"].fillna(modeEmbarked)

In [178]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

Cinsiyete göre hayatta kalma sayılarını karşılaştırma (pd.crosstab() kullanarak)

In [179]:
df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [180]:
df["Embarked"].unique()

array(['S', 'C', 'Q'], dtype=object)

In [181]:
df["Sex_numeric"] = df["Sex"].map({"male":1,"female":0})

In [182]:
embarked_dummies = pd.get_dummies(df["Embarked"],prefix="Embarked")
embarked_dummies

     Embarked_C  Embarked_Q  Embarked_S
0         False       False        True
1          True       False       False
2         False       False        True
3         False       False        True
4         False       False        True
..          ...         ...         ...
886       False       False        True
887       False       False        True
888       False       False        True
889        True       False       False
890       False        True       False

[891 rows x 3 columns]

In [183]:
df = pd.concat([df,embarked_dummies],axis=1)

In [184]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Sex_numeric,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,1,False,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,0,True,False,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,0,False,False,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,0,False,False,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,1,False,False,True

In [185]:
def yasgrup(age):
    if age <= 12:
        return "Çocuk"
    elif age <= 18:
        return "Genç"
    elif age <= 60:
        return "Yetişkin"
    else:
        return "Yaşlı"

df["AgeGroup"] = df["Age"].apply(yasgrup)

In [186]:
# * Cinsiyete göre hayatta kalma sayılarını karşılaştırma (pd.crosstab() kullanarak)
cinsiyet_analiz = pd.crosstab(df["Sex"],df["Survived"],margins=True)
cinsiyet_analiz

Survived    0    1  All
Sex
female     81  233  314
male      468  109  577
All       549  342  891

Yaş gruplarının hayatta kalma oranlarını görselleştirme

In [187]:
pd.crosstab(df["AgeGroup"],df["Survived"],margins=True)

Survived    0    1  All
AgeGroup
Genç       40   30   70
Yaşlı      17    5   22
Yetişkin  463  267  730
Çocuk      29   40   69
All       549  342  891

In [188]:
# * Yaş gruplarının hayatta kalma oranlarını görselleştirme
df.groupby('AgeGroup')["Survived"].mean()

AgeGroup
Genç        0.428571
Yaşlı       0.227273
Yetişkin    0.365753
Çocuk       0.579710
Name: Survived, dtype: float64

Sınıflara göre bilet fiyatlarının ortalamasını hesapla

En çok hangi limandan yolcu bindiğini bulma

In [189]:
liman_analiz = df["Embarked"].value_counts()
liman_analiz

liman_oran = df.groupby("Embarked")["Survived"].mean()
liman_oran

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

Korelasyon matrisi üzerinden bilgi okumak